/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   6.HZOJ-103.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: chen_dl <19967657938@163.com>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/01/10 14:54:40 by chen_dl           #+#    #+#             */
/*   Updated: 2025/01/10 19:21:48 by chen_dl          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*
题目描述
​ 判断一个整数 a 能否被另一个整数 b 整除。

输入
​ 输入两个整数 a,b （1≤a,b≤500）

输出
​ a 能被 b 整除输出 YES 否则输出 NO

样例输入
21 7
样例输出
YES
数据规模与约定
​ 时间限制：1 s

​ 内存限制：256 M

​ 100% 的数据保证 1≤a,b≤500
*/
#include <stdio.h>

int main() {
    int a, b;
    scanf("%d%d", &a, &b);
    // (a % b) && printf("NO\n");
    // !(a % b) && printf("YES\n");
    printf("%s\n", (a % b == 0) ? "YES" : "NO");
    return 0;
}
