/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   5.sprintf.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: chen_dl <19967657938@163.com>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/12/20 09:00:48 by chen_dl           #+#    #+#             */
/*   Updated: 2024/12/22 19:44:12 by chen_dl          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*
将sprintf内容输出到字符串中
sscanf: 将字符串转换成其它信息
sprintf: 将其它信息转换成字符串信息
*/

#include <stdio.h>

int main() {
    char str[100] = "192.168.74.131";
    int a, b, c, d;
    sscanf(str, "%d.%d.%d.%d.", &a, &b, &c, &d);
    sprintf(str, "%d:%d:%d:%d", a, b, c, d);
    printf("std = %s\n", str);

    return 0;
}